Repository: WECARE-BMA/wecare_app
Catalog: lib/l10n/app_*.arb
Languages: am

# help
source: Help These Kids
am: እነዚን ልጆች ይርዷቸው

# urgent
source: Urgent Fundraising
am: አስቸኳይ ድጎማ

# newf
source: New Fundraising
am: አዲስ ድጎማ

# history
source: History of your donations
am: የመዋጮ ታሪክ ዝርዝር

# saved
source: Saved for later donations
am: ለበኋላ የተቀመጡ መዋጮች

source: Logout
am: ተሰናበት

# edit
source: Edit Profile
am: ፕሮፍይል አስተካክል

# donation
source: Donations
am: ልገሳዎች

source: Causes
am: ጉዳዮች

source: Profile
am: መገለጫ

# historybn
source: History
am: ታሪክ

source: Home
am: መነሻ
